#1Какие типы данных есть в python. И какие изменияемые и не изм  

# int 
# str 
# float
# bool 

# set
# frozenset 
# list 
# dict
# tuple
#########################################################################

#2 Принципы ООП 

#Наследование - мы принимаем параметры для дочернего класса от род.класса  
#Инкапцуляция - это для защиты нашего кода 
#Палиморфизм - принимаем параметры от род класса к дочернему и в нем же изменияем  
#Абстракция - Абстракция используется, чтобы скрыть внутренние характеристики функции от пользователей


#3 Что такое inline кнопки в aiogram ?

# 
#########################################################################

#4 Что такое django ORM ? 

# Обработчик бд 

#########################################################################

# 5 авто документация DRF ? 

#swagger 
#redoc


#########################################################################

# 6 Типы HTTP-запросов 


# GET — получение ресурса
# POST — создание ресурса
# PUT — обновление ресурса
# DELETE — удаление ресурсаx

#########################################################################


# 7 Зачем нужен Serializer.py 

# для отабрадение данных в Json формате, в апишке 
#########################################################################


#8 за что отвечают папка templates и static в django проекте 

# обрабоьчик медиа файлов 
#########################################################################



#9 Зачем нужен permissions.py  

# для защиты данных от пользователей 
# задать роли 

##################################################################


#10 Встроенные функции 
# print
# input
# min 
# max 
# sum 
# len
# range
# set 
# type
# reversed 


#10 что такое lambda ?
 
# для сокращения кода (функции)  







# Дается 2 строки "Aidana" и "Adilet" . 
# Вам нужно в результате получить смешанную
# строку из двух имен, буква за буквой.
# Результат: "AAiddialnea




# a = """Advertising companies say advertising is necessary and important. It informs people about
# new products. Advertising hoardings in the street make our environment colourful. And
# adverts on TV are often funny. Sometimes they are mini-dramas and we wait for the next
# programme in the mini-drama. Advertising can educate, too. Adverts tell us about new,
# healthy products. And adverts in magazines give us ideas for how to look prettier, be
# fashionable and be successful. Without advertising, life is boring and colourless.
# But some consumers argue that advertising is a bad thing. They say that advertising is bad
# for children. Adverts make children ‘pester’ their parents buy things for them. Advertisers
# know we love our children and want to give them everything. So they use children’s ‘pester
# power’ to sell their products. Finally, consumers say, if there is advertising there must be
# rules. Some adverts advertise unhealthy things like cigarettes and make people waste their
# money."""

# print((((((((((((((((a.count("s")))))))))))))))))


################################################################################

 ##############################   ДЕНЬ2   #######################################




#  Что такое класс models.Model в Django от которго мы наследуемся 

# встроенный абстрактный класс 
#  






# Что такое объектно-ориентированное программирование 
# (ООП) и какие основные концепции оно включает в себя?

# Объектно-ориентированное программирование (ООП) - это парадигма 
# программирования, основанная на концепции объектов,
# которые являются инстансами классов, и взаимодействии между ними.

# Чем отличается класс от объекта в Python?

# Класс - это шаблон или описание объекта, определяющий его атрибуты и методы.
# Объект - это конкретный экземпляр класса.

# Как создать класс в Python? Приведите пример.



# Как создать объект (экземпляр) класса в Python?



# Что такое атрибуты класса и как их определять? 



# Что такое методы класса? Какие бывают типы методов в Python?



# 1) Есть список numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
# Выведите с помощью lambda функции чётные числа с списка


# 2) Напишите функцию где мы передаем через аргументы число n как целое
# integer, надо вывести целое число в перевернутом виде
# например: n = 27, тогда перевёрнутое n это 72 


# 3) Вывести на экран циклом пять строк из нулей, причем каждая строка
# должна быть пронумерована. Подсказка: Используйте функцию range()
# или enumerate()




# 1)Создайте класс с именем Employee.

# 2) У класса Employee должны быть следующие атрибуты (характеристики сотрудника):

# name (имя сотрудника)
# age (возраст сотрудника)
# position (должность сотрудника)
# salary (заработная плата сотрудника)
